Attiny2313/SCARA-Robot-Controler-BT/src/main.cpp
/*
 * SCARA Robot Controller / Sterownik robota SCARA
 *
 * PL: Sterownik 3-osiowego robota SCARA z ręcznym sterowaniem z pada,
 *     zapisem punktów TEACH i automatycznym odtwarzaniem programu.
 * EN: Controller for a 3-axis SCARA robot with gamepad manual control,
 *     TEACH point storage and automatic program playback.
 *
 * PL: Homing jest wykonywany ręcznie. Przed uruchomieniem operator musi
 *     ustawić robota w pozycji HOME zdefiniowanej poniżej.
 * EN: Homing is manual. Before startup, the operator must place the robot
 *     in the HOME position defined below.
 */

#include <Arduino.h>
#include <Bluepad32.h>
#include <FastAccelStepper.h>
#include <ESP32Servo.h>
#include <Preferences.h>

// ============================================================
// PINY / PIN ASSIGNMENTS
// ============================================================
constexpr uint8_t PIN_LED_BT       = 4;
constexpr uint8_t PIN_LED_ERROR    = 16;
constexpr uint8_t PIN_LED_STATUS   = 17;

constexpr uint8_t PIN_STEP_ARM1    = 13;
constexpr uint8_t PIN_DIR_ARM1     = 26;
constexpr uint8_t PIN_STEP_ARM2    = 23;
constexpr uint8_t PIN_DIR_ARM2     = 14;
constexpr uint8_t PIN_STEP_Z       = 18;
constexpr uint8_t PIN_DIR_Z        = 19;

constexpr uint8_t PIN_SERVO_ROTATE = 27;
constexpr uint8_t PIN_SERVO_GRIP   = 32;

constexpr uint8_t PIN_BUTTON_TEACH = 25;
constexpr uint8_t PIN_BUTTON_MODE  = 33;
constexpr uint8_t PIN_ESTOP        = 39;

// PL: Wejścia krańcówek są zachowane sprzętowo na przyszłość.
//     Aktualna wersja programu używa ręcznego homingu.
// EN: Endstop inputs are kept in hardware for future use.
//     The current firmware uses manual homing.
constexpr uint8_t PIN_ENDSTOP_Z    = 34;
constexpr uint8_t PIN_ENDSTOP_ARM1 = 35;
constexpr uint8_t PIN_ENDSTOP_ARM2 = 36;

// ============================================================
// KONFIGURACJA MECHANIKI / MECHANICAL CONFIGURATION
// ============================================================
constexpr float ARM_LENGTH_1_MM = 91.61f;
constexpr float ARM_LENGTH_2_MM = 97.528f;

constexpr float MOTOR_STEPS_REV = 200.0f;
constexpr float MICROSTEPS      = 16.0f;

constexpr float GEAR_ARM1 = 3.875f;
constexpr float GEAR_ARM2 = 7.280f;
constexpr float Z_SCREW_LEAD_MM = 2.0f;
constexpr float GEAR_Z          = 1.0f;

// PL: Znak osi pozwala odwrócić kierunek logiczny bez przepinania przewodów.
// EN: Axis sign allows logical direction reversal without rewiring the motor.
constexpr int8_t SIGN_ARM1 = 1;
constexpr int8_t SIGN_ARM2 = 1;
constexpr int8_t SIGN_Z    = 1;

constexpr float STEPS_PER_DEG_ARM1 =
    MOTOR_STEPS_REV * MICROSTEPS * GEAR_ARM1 / 360.0f;
constexpr float STEPS_PER_DEG_ARM2 =
    MOTOR_STEPS_REV * MICROSTEPS * GEAR_ARM2 / 360.0f;
constexpr float STEPS_PER_MM_Z =
    MOTOR_STEPS_REV * MICROSTEPS * GEAR_Z / Z_SCREW_LEAD_MM;

// ============================================================
// RĘCZNY HOME / MANUAL HOME
// ============================================================
// PL: Przed włączeniem lub resetem robot musi zostać ręcznie ustawiony
//     w pozycji HOME. Program przyjmuje te wartości jako pozycję aktualną.
// EN: Before power-up or reset the robot must be manually placed in HOME.
//     The firmware assumes these values are the actual startup position.
constexpr float HOME_ARM1_DEG = 115.0f;
constexpr float HOME_ARM2_DEG = -147.0f;
constexpr float HOME_Z_MM     = 0.0f;
constexpr float HOME_TOOL_ROTATE_DEG = 90.0f;
constexpr float HOME_GRIP_DEG        = 30.0f;

// ============================================================
// OGRANICZENIA PROGRAMOWE / SOFTWARE LIMITS
// ============================================================
// PL: Ograniczenia chronią mechanikę w trybach MANUAL, TOOL i AUTO.
// EN: These limits protect the mechanism in MANUAL, TOOL and AUTO modes.
constexpr float ARM1_MIN_DEG = -115.0f;
constexpr float ARM1_MAX_DEG =  115.0f;
constexpr float ARM2_MIN_DEG = -147.0f;
constexpr float ARM2_MAX_DEG =  147.0f;
constexpr float Z_MIN_MM = 0.0f;
constexpr float Z_MAX_MM = 300.0f;
constexpr float TOOL_ROTATE_MIN_DEG = 0.0f;
constexpr float TOOL_ROTATE_MAX_DEG = 180.0f;
constexpr float GRIP_MIN_DEG = 15.0f;
constexpr float GRIP_MAX_DEG = 95.0f;

// ============================================================
// PRĘDKOŚCI I PRZYSPIESZENIA / SPEEDS AND ACCELERATIONS
// ============================================================
// PL: ARM1 i ARM2 mają tę samą prędkość kątową w sterowaniu ręcznym.
// EN: ARM1 and ARM2 use the same angular speed in manual control.
constexpr float ARM1_JOG_SPEED_DEG_S = 25.0f;
constexpr float ARM2_JOG_SPEED_DEG_S = 25.0f;

// PL: Prędkość osi Z po prawidłowym ustawieniu MS1/MS2/MS3.
// EN: Z-axis speed with MS1/MS2/MS3 configured correctly.
constexpr float Z_JOG_SPEED_MM_S     = 1.5f;
constexpr float TOOL_XY_SPEED_MM_S   = 20.0f;

// PL: Bazowe prędkości programu automatycznego.
// EN: Base speeds used by the automatic program.
constexpr float AUTO_ARM1_SPEED_DEG_S = 20.0f;
constexpr float AUTO_ARM2_SPEED_DEG_S = 20.0f;
constexpr float AUTO_Z_SPEED_MM_S     = 1.5f;

// PL: Override prędkości AUTO dotyczy tylko ramion. D-pad góra/dół zmienia
//     wartość o 10%, a D-pad lewo przywraca 100%. Z pozostaje bez zmian.
// EN: AUTO speed override affects the arms only. D-pad up/down changes it
//     by 10%, while D-pad left restores 100%. Z speed remains unchanged.
constexpr uint16_t AUTO_ARM_SPEED_PERCENT_DEFAULT = 100;
constexpr uint16_t AUTO_ARM_SPEED_PERCENT_MIN     = 50;
constexpr uint16_t AUTO_ARM_SPEED_PERCENT_MAX     = 250;
constexpr uint16_t AUTO_ARM_SPEED_PERCENT_STEP    = 10;

constexpr float TOOL_ROTATE_SPEED_DEG_S = 35.0f;
constexpr float GRIP_SPEED_DEG_S        = 45.0f;

constexpr int SERVO_ROTATE_MIN_US = 500;
constexpr int SERVO_ROTATE_MAX_US = 2500;
constexpr int SERVO_GRIP_MIN_US   = 500;
constexpr int SERVO_GRIP_MAX_US   = 2500;
constexpr float SERVO_FILTER_ALPHA = 0.20f;

// PL: Twarde limity częstotliwości STEP są dodatkowym zabezpieczeniem,
//     niezależnym od prędkości zadawanej przez JOINT, TOOL lub AUTO.
// EN: Hard STEP frequency limits provide an additional safety layer,
//     independent of speeds requested by JOINT, TOOL or AUTO control.
constexpr uint32_t ARM1_MAX_STEP_HZ = 10000;
constexpr uint32_t ARM2_MAX_STEP_HZ = 3000;

// PL: Przy 1600 STEP/mm: 2400 Hz = 1.5 mm/s.
// EN: At 1600 STEP/mm: 2400 Hz = 1.5 mm/s.
constexpr uint32_t Z_MAX_STEP_HZ    = 2400;

constexpr uint32_t ARM1_ACCEL = 12000;
constexpr uint32_t ARM2_ACCEL = 5000;

// PL: Krótsza rampa Z: 3000 STEP/s² = 1.875 mm/s² przy 1600 STEP/mm.
// EN: Shorter Z ramp: 3000 STEP/s² = 1.875 mm/s² at 1600 STEP/mm.
constexpr uint32_t Z_ACCEL    = 3000;

