Attiny2313/SCARA-Robot-Controler-BT/src/main.cpp
// ============================================================
// CZASY I AUTO / TIMING AND AUTO SETTINGS
// ============================================================
constexpr uint32_t CONTROL_PERIOD_MS = 10;
constexpr uint32_t SERVO_PERIOD_MS = 20;
constexpr uint32_t GAMEPAD_TIMEOUT_MS = 500;
constexpr uint32_t GAMEPAD_ARM_NEUTRAL_MS = 300;
constexpr uint32_t BUTTON_DEBOUNCE_MS = 40;
constexpr uint32_t TEACH_LONG_PRESS_MS = 1800;
constexpr uint32_t DEFAULT_POINT_DWELL_MS = 400;
constexpr int16_t JOYSTICK_DEADZONE = 90;
constexpr float MAX_CONTROL_DT_S = 0.05f;
constexpr uint8_t MAX_PROGRAM_POINTS = 20;
constexpr bool AUTO_LOOP_PROGRAM = true;

// ============================================================
// STRUKTURY I STANY / DATA TYPES AND STATES
// ============================================================
enum class ControlMode : uint8_t {
    JOINT,
    TOOL
};

enum class OperatingMode : uint8_t {
    MANUAL,
    AUTO
};

enum class AutoState : uint8_t {
    IDLE,
    MOVE,
    DWELL,
    PAUSED,
    FINISHED,
    FAULT
};

struct JointPosition {
    float arm1Deg;
    float arm2Deg;
    float zMm;
};

struct CartesianPosition {
    float xMm;
    float yMm;
    float zMm;
};

// PL: Jeden punkt programu zawiera pozycję osi, pozycje serw i czas postoju.
// EN: One program point stores joint positions, servo targets and dwell time.
struct ProgramPoint {
    JointPosition joints;
    float toolRotateDeg;
    float gripperDeg;
    uint32_t dwellMs;
};

struct RobotState {
    JointPosition joints;
    JointPosition actualJoints;
    CartesianPosition tcp;
    CartesianPosition actualTcp;

    float toolRotateDeg;
    float gripperDeg;

    ControlMode controlMode;
    OperatingMode operatingMode;
    AutoState autoState;

    bool estopLatched;
    bool controllerConnected;
    bool gamepadArmed;
};

// ============================================================
// OBIEKTY I STAN GLOBALNY / GLOBAL OBJECTS AND STATE
// ============================================================
FastAccelStepperEngine stepperEngine;
FastAccelStepper* stepperArm1 = nullptr;
FastAccelStepper* stepperArm2 = nullptr;
FastAccelStepper* stepperZ    = nullptr;

Servo servoRotate;
Servo servoGrip;
Preferences preferences;
ControllerPtr controllers[BP32_MAX_GAMEPADS];
RobotState robot;

ProgramPoint programPoints[MAX_PROGRAM_POINTS];
uint8_t programPointCount = 0;
uint8_t currentProgramPoint = 0;
bool autoMotionStarted = false;
uint32_t autoDwellStartedMs = 0;

uint32_t lastControlMs = 0;
uint32_t lastServoUpdateMs = 0;
uint32_t lastGamepadPacketMs = 0;
uint32_t gamepadNeutralSinceMs = 0;
uint32_t lastModeButtonEdgeMs = 0;
uint32_t lastTeachButtonEdgeMs = 0;
uint32_t teachPressStartedMs = 0;

float servoRotateFilteredDeg = HOME_TOOL_ROTATE_DEG;
float servoGripFilteredDeg = HOME_GRIP_DEG;

uint16_t autoArmSpeedPercent = AUTO_ARM_SPEED_PERCENT_DEFAULT;
uint8_t previousAutoDpad = 0;

bool previousModeButton = LOW;
bool previousTeachButton = LOW;
bool previousPadStart = false;

// ============================================================
// FUNKCJE POMOCNICZE / HELPER FUNCTIONS
// ============================================================
float clampFloat(float value, float minimum, float maximum) {
    if (value < minimum) return minimum;
    if (value > maximum) return maximum;
    return value;
}

uint32_t clampStepHz(float hz, uint32_t maximumHz) {
    if (hz < 1.0f) return 1;
    if (hz > static_cast<float>(maximumHz)) return maximumHz;
    return static_cast<uint32_t>(lroundf(hz));
}

float degToRad(float degrees) {
    return degrees * PI / 180.0f;
}

float radToDeg(float radians) {
    return radians * 180.0f / PI;
}

// PL: Normalizacja osi pada do zakresu -1...+1 z martwą strefą.
// EN: Normalize a gamepad axis to -1...+1 with a dead zone around center.
float normalizeJoystick(int32_t value) {
    if (abs(value) < JOYSTICK_DEADZONE) return 0.0f;
    constexpr float maximumAxisValue = 512.0f;
    return clampFloat(static_cast<float>(value) / maximumAxisValue, -1.0f, 1.0f);
}

int32_t arm1DegreesToSteps(float angleDeg) {
    return lroundf(angleDeg * STEPS_PER_DEG_ARM1 * SIGN_ARM1);
}

int32_t arm2DegreesToSteps(float angleDeg) {
    return lroundf(angleDeg * STEPS_PER_DEG_ARM2 * SIGN_ARM2);
}

int32_t zMillimetersToSteps(float zMm) {
    return lroundf(zMm * STEPS_PER_MM_Z * SIGN_Z);
}

float arm1StepsToDegrees(int32_t steps) {
    return static_cast<float>(steps) / (STEPS_PER_DEG_ARM1 * SIGN_ARM1);
}

float arm2StepsToDegrees(int32_t steps) {
    return static_cast<float>(steps) / (STEPS_PER_DEG_ARM2 * SIGN_ARM2);
}

float zStepsToMillimeters(int32_t steps) {
    return static_cast<float>(steps) / (STEPS_PER_MM_Z * SIGN_Z);
}

// PL: Zwraca aktualny mnożnik prędkości ramion AUTO.
// EN: Return the current AUTO arm speed multiplier.
float autoArmSpeedScale() {
    return static_cast<float>(autoArmSpeedPercent) / 100.0f;
}

void setAutoArmSpeedPercent(int32_t requestedPercent) {
    const uint16_t clampedPercent = static_cast<uint16_t>(constrain(
        requestedPercent,
        static_cast<int32_t>(AUTO_ARM_SPEED_PERCENT_MIN),
        static_cast<int32_t>(AUTO_ARM_SPEED_PERCENT_MAX)));

    if (clampedPercent == autoArmSpeedPercent) return;

    autoArmSpeedPercent = clampedPercent;
    Serial.printf("AUTO SPEED ARM: %u%% (A1=%.1f deg/s, A2=%.1f deg/s)\n",
                  autoArmSpeedPercent,
                  AUTO_ARM1_SPEED_DEG_S * autoArmSpeedScale(),
                  AUTO_ARM2_SPEED_DEG_S * autoArmSpeedScale());
}

// PL: D-pad działa na zboczu, więc jedno naciśnięcie daje dokładnie jeden krok.
//     Zmiana obowiązuje od następnego punktu PTP, nie w środku bieżącego ruchu.
// EN: D-pad is edge-triggered, so one press produces exactly one step.
//     The change takes effect at the next PTP point, not mid-move.
void processAutoSpeedDpad(uint8_t dpad) {
    const bool upPressed = (dpad & DPAD_UP) != 0 && (previousAutoDpad & DPAD_UP) == 0;
    const bool downPressed = (dpad & DPAD_DOWN) != 0 && (previousAutoDpad & DPAD_DOWN) == 0;
    const bool leftPressed = (dpad & DPAD_LEFT) != 0 && (previousAutoDpad & DPAD_LEFT) == 0;

    if (leftPressed) {
        setAutoArmSpeedPercent(AUTO_ARM_SPEED_PERCENT_DEFAULT);
    } else if (upPressed) {
        setAutoArmSpeedPercent(static_cast<int32_t>(autoArmSpeedPercent) + AUTO_ARM_SPEED_PERCENT_STEP);
    } else if (downPressed) {
        setAutoArmSpeedPercent(static_cast<int32_t>(autoArmSpeedPercent) - AUTO_ARM_SPEED_PERCENT_STEP);
    }

    previousAutoDpad = dpad;
}

