Attiny2313/SCARA-Robot-Controler-BT/src/main.cpp
    const float d1 = fabsf(clamped.arm1Deg - robot.actualJoints.arm1Deg);
    const float d2 = fabsf(clamped.arm2Deg - robot.actualJoints.arm2Deg);
    const float dz = fabsf(clamped.zMm - robot.actualJoints.zMm);

    // PL: Override skaluje wyłącznie ramiona. Z zachowuje stałą prędkość bazową.
    // EN: The override scales the arms only. Z keeps its fixed base speed.
    const float armScale = autoArmSpeedScale();
    const float arm1AutoSpeed = AUTO_ARM1_SPEED_DEG_S * armScale;
    const float arm2AutoSpeed = AUTO_ARM2_SPEED_DEG_S * armScale;

    const float t1 = d1 / arm1AutoSpeed;
    const float t2 = d2 / arm2AutoSpeed;
    const float tz = dz / AUTO_Z_SPEED_MM_S;
    const float moveTime = fmaxf(0.01f, fmaxf(t1, fmaxf(t2, tz)));

    if (d1 > 0.001f) {
        stepperArm1->setSpeedInHz(clampStepHz(
            d1 / moveTime * STEPS_PER_DEG_ARM1, ARM1_MAX_STEP_HZ));
    }
    if (d2 > 0.001f) {
        stepperArm2->setSpeedInHz(clampStepHz(
            d2 / moveTime * STEPS_PER_DEG_ARM2, ARM2_MAX_STEP_HZ));
    }
    if (dz > 0.001f) {
        stepperZ->setSpeedInHz(clampStepHz(
            dz / moveTime * STEPS_PER_MM_Z, Z_MAX_STEP_HZ));
    }

    stepperArm1->moveTo(arm1DegreesToSteps(clamped.arm1Deg));
    stepperArm2->moveTo(arm2DegreesToSteps(clamped.arm2Deg));
    stepperZ->moveTo(zMillimetersToSteps(clamped.zMm));

    robot.joints = clamped;
    robot.tcp = forwardKinematics(robot.joints);
}

// ============================================================
// PROGRAM TEACH I NVS / TEACH PROGRAM AND NVS STORAGE
// ============================================================
// PL: Program jest zapisywany w pamięci NVS ESP32 i pozostaje po restarcie.
// EN: The taught program is stored in ESP32 NVS and survives a restart.
void saveProgram() {
    preferences.putUChar("count", programPointCount);
    if (programPointCount > 0) {
        preferences.putBytes("points", programPoints,
                             sizeof(ProgramPoint) * programPointCount);
    } else if (preferences.isKey("points")) {
        preferences.remove("points");
    }
}

void loadProgram() {
    programPointCount = preferences.getUChar("count", 0);
    if (programPointCount > MAX_PROGRAM_POINTS) {
        programPointCount = 0;
        saveProgram();
        return;
    }

    if (programPointCount > 0) {
        const size_t expected = sizeof(ProgramPoint) * programPointCount;
        if (preferences.getBytesLength("points") != expected ||
            preferences.getBytes("points", programPoints, expected) != expected) {
            programPointCount = 0;
            saveProgram();
        }
    }
}

void clearProgram() {
    if (robot.operatingMode != OperatingMode::MANUAL || axesRunning()) return;
    programPointCount = 0;
    currentProgramPoint = 0;
    saveProgram();
    Serial.println("TEACH: program wyczyszczony");
}

// PL: Punkt można zapisać tylko w MANUAL i po całkowitym zatrzymaniu osi.
// EN: A point can only be taught in MANUAL and after all axes have stopped.
void teachCurrentPoint() {
    if (robot.estopLatched || robot.operatingMode != OperatingMode::MANUAL) return;
    if (axesRunning()) {
        Serial.println("TEACH: zatrzymaj osie przed zapisaniem punktu");
        return;
    }
    if (programPointCount >= MAX_PROGRAM_POINTS) {
        Serial.println("TEACH: brak miejsca na kolejny punkt");
        return;
    }

    updateActualRobotPosition();
    ProgramPoint& p = programPoints[programPointCount];
    p.joints = robot.actualJoints;
    p.toolRotateDeg = robot.toolRotateDeg;
    p.gripperDeg = robot.gripperDeg;
    p.dwellMs = DEFAULT_POINT_DWELL_MS;

    programPointCount++;
    saveProgram();

    Serial.printf("TEACH: zapisano P%02u  A1=%.2f A2=%.2f Z=%.2f ROT=%.1f GRIP=%.1f\n",
                  programPointCount,
                  p.joints.arm1Deg, p.joints.arm2Deg, p.joints.zMm,
                  p.toolRotateDeg, p.gripperDeg);
}

// ============================================================
// TRYB AUTOMATYCZNY / AUTOMATIC MODE
// ============================================================
void setAutoFault(const char* reason) {
    emergencyStopMotion();
    robot.autoState = AutoState::FAULT;
    autoMotionStarted = false;
    digitalWrite(PIN_LED_ERROR, HIGH);
    if (reason != nullptr) Serial.println(reason);
}

// PL: Pauza zatrzymuje osie i synchronizuje pozycję z licznikami kroków,
//     dzięki czemu wznowienie startuje z faktycznej pozycji robota.
// EN: Pause stops the axes and synchronizes the commanded position with the
//     step counters so resume starts from the robot's actual position.
void pauseAuto(const char* reason) {
    if (robot.operatingMode != OperatingMode::AUTO) return;
    if (robot.autoState == AutoState::IDLE ||
        robot.autoState == AutoState::FINISHED ||
        robot.autoState == AutoState::FAULT) return;

    emergencyStopMotion();
    updateActualRobotPosition();
    robot.joints = robot.actualJoints;
    robot.tcp = robot.actualTcp;
    robot.autoState = AutoState::PAUSED;
    autoMotionStarted = false;
    if (reason != nullptr) Serial.println(reason);
}

void startAuto() {
    if (robot.estopLatched || robot.operatingMode != OperatingMode::AUTO) return;
    if (programPointCount == 0) {
        Serial.println("AUTO: brak zapisanych punktów");
        return;
    }

    currentProgramPoint = 0;
    autoMotionStarted = false;
    robot.autoState = AutoState::MOVE;
    digitalWrite(PIN_LED_ERROR, LOW);
    Serial.printf("AUTO START: %u punktów, ARM speed %u%%\n",
                  programPointCount, autoArmSpeedPercent);
}

void toggleAutoRunPause() {
    if (robot.operatingMode != OperatingMode::AUTO || robot.estopLatched) return;

    switch (robot.autoState) {
        case AutoState::IDLE:
        case AutoState::FINISHED:
            startAuto();
            break;

        case AutoState::MOVE:
        case AutoState::DWELL:
            pauseAuto("AUTO PAUSE");
            break;

        case AutoState::PAUSED:
            robot.autoState = AutoState::MOVE;
            autoMotionStarted = false;
            Serial.printf("AUTO RESUME: P%02u\n", currentProgramPoint + 1);
            break;

        case AutoState::FAULT:
            Serial.println("AUTO: FAULT - wymagany restart po E-STOP");
            break;
    }
}

void startCurrentProgramPoint() {
    if (currentProgramPoint >= programPointCount) {
        setAutoFault("AUTO: błędny indeks punktu");
        return;
    }

