Attiny2313/SCARA-Robot-Controler-BT/src/main.cpp
    const ProgramPoint& p = programPoints[currentProgramPoint];
    robot.toolRotateDeg = clampFloat(p.toolRotateDeg,
                                    TOOL_ROTATE_MIN_DEG, TOOL_ROTATE_MAX_DEG);
    robot.gripperDeg = clampFloat(p.gripperDeg,
                                 GRIP_MIN_DEG, GRIP_MAX_DEG);
    commandAutoJointPosition(p.joints);
    autoMotionStarted = true;

    Serial.printf("AUTO -> P%02u/%02u  ARM speed=%u%%\n",
                  currentProgramPoint + 1, programPointCount, autoArmSpeedPercent);
}

// PL: Maszyna stanów AUTO: ruch -> postój -> kolejny punkt.
// EN: AUTO state machine: move -> dwell -> next point.
void processAuto() {
    if (robot.operatingMode != OperatingMode::AUTO || robot.estopLatched) return;

    switch (robot.autoState) {
        case AutoState::IDLE:
        case AutoState::PAUSED:
        case AutoState::FINISHED:
        case AutoState::FAULT:
            return;

        case AutoState::MOVE:
            if (!autoMotionStarted) {
                startCurrentProgramPoint();
                if (robot.autoState == AutoState::FAULT) return;
            }

            if (autoMotionStarted && motionFinished()) {
                autoMotionStarted = false;
                autoDwellStartedMs = millis();
                robot.autoState = AutoState::DWELL;
            }
            break;

        case AutoState::DWELL: {
            const uint32_t dwell = programPoints[currentProgramPoint].dwellMs;
            if (millis() - autoDwellStartedMs < dwell) return;

            currentProgramPoint++;
            if (currentProgramPoint >= programPointCount) {
                if (AUTO_LOOP_PROGRAM) {
                    currentProgramPoint = 0;
                    Serial.println("AUTO: kolejny cykl");
                } else {
                    robot.autoState = AutoState::FINISHED;
                    Serial.println("AUTO: program zakończony");
                    return;
                }
            }

            robot.autoState = AutoState::MOVE;
            autoMotionStarted = false;
            break;
        }
    }
}

// ============================================================
// E-STOP / EMERGENCY STOP
// ============================================================
// PL: E-STOP jest zatrzaskiwany programowo. Po aktywacji wymagany jest restart.
// EN: E-STOP is latched in software. A restart is required after activation.
void updateEmergencyStop() {
    const bool estopActive = digitalRead(PIN_ESTOP) == HIGH;

    if (estopActive && !robot.estopLatched) {
        robot.estopLatched = true;
        robot.gamepadArmed = false;
        emergencyStopMotion();
        robot.autoState = AutoState::FAULT;
        digitalWrite(PIN_LED_ERROR, HIGH);
        digitalWrite(PIN_LED_STATUS, LOW);
        Serial.println("E-STOP AKTYWNY - wymagany restart sterownika");
    }
}

// ============================================================
// TRYBY I PANEL / MODES AND CONTROL PANEL
// ============================================================
void toggleControlMode() {
    if (robot.estopLatched || !robot.gamepadArmed ||
        robot.operatingMode != OperatingMode::MANUAL) return;

    robot.controlMode =
        (robot.controlMode == ControlMode::JOINT) ? ControlMode::TOOL : ControlMode::JOINT;

    Serial.println(robot.controlMode == ControlMode::TOOL ? "MANUAL: TOOL" : "MANUAL: JOINT");
}

// PL: MODE przełącza wyłącznie przy zatrzymanych osiach.
// EN: MODE can only be changed while all axes are stopped.
void toggleOperatingMode() {
    if (robot.estopLatched) return;
    if (axesRunning()) {
        Serial.println("MODE: zatrzymaj osie przed zmianą MANUAL/AUTO");
        return;
    }

    if (robot.operatingMode == OperatingMode::MANUAL) {
        robot.operatingMode = OperatingMode::AUTO;
        robot.autoState = AutoState::IDLE;
        robot.gamepadArmed = false;
        previousPadStart = false;
        previousAutoDpad = 0;
        Serial.printf("Tryb pracy: AUTO (%u punktów). START = uruchom/pauza, ARM speed=%u%%\n",
                      programPointCount, autoArmSpeedPercent);
    } else {
        emergencyStopMotion();
        robot.operatingMode = OperatingMode::MANUAL;
        robot.autoState = AutoState::IDLE;
        autoMotionStarted = false;
        robot.gamepadArmed = false;
        gamepadNeutralSinceMs = 0;
        previousPadStart = false;
        previousAutoDpad = 0;
        updateActualRobotPosition();
        robot.joints = robot.actualJoints;
        robot.tcp = robot.actualTcp;
        Serial.println("Tryb pracy: MANUAL - oczekiwanie na neutralny pad");
    }

    digitalWrite(PIN_LED_STATUS,
                 robot.operatingMode == OperatingMode::AUTO ? HIGH : LOW);
}

void printCurrentPosition() {
    updateActualRobotPosition();

    Serial.println();
    Serial.println("----- STAN ROBOTA -----");
    Serial.printf("A1 ACT/CMD: %.2f / %.2f deg\n",
                  robot.actualJoints.arm1Deg, robot.joints.arm1Deg);
    Serial.printf("A2 ACT/CMD: %.2f / %.2f deg\n",
                  robot.actualJoints.arm2Deg, robot.joints.arm2Deg);
    Serial.printf("Z  ACT/CMD: %.2f / %.2f mm\n",
                  robot.actualJoints.zMm, robot.joints.zMm);
    Serial.printf("TCP ACT X/Y: %.2f / %.2f mm\n",
                  robot.actualTcp.xMm, robot.actualTcp.yMm);
    Serial.printf("ROT: %.1f  GRIP: %.1f\n",
                  robot.toolRotateDeg, robot.gripperDeg);
    Serial.printf("WORK: %s  MANUAL: %s\n",
                  robot.operatingMode == OperatingMode::AUTO ? "AUTO" : "MANUAL",
                  robot.controlMode == ControlMode::TOOL ? "TOOL" : "JOINT");
    Serial.printf("AUTO ARM speed: %u%%\n", autoArmSpeedPercent);
    Serial.printf("TEACH points: %u/%u\n", programPointCount, MAX_PROGRAM_POINTS);
    Serial.printf("Pad: %s\n", robot.gamepadArmed ? "ARMED" : "SAFE");
    Serial.println("-----------------------");
}

// PL: Oba przyciski panelu są aktywne stanem HIGH i korzystają z INPUT_PULLDOWN.
//     TEACH: krótkie naciśnięcie zapisuje punkt, długie kasuje program.
// EN: Both panel buttons are active HIGH and use INPUT_PULLDOWN.
//     TEACH: short press stores a point, long press clears the program.
void updatePanelButtons() {
    const uint32_t now = millis();
    const bool modeButton = digitalRead(PIN_BUTTON_MODE);
    const bool teachButton = digitalRead(PIN_BUTTON_TEACH);

    if (previousModeButton == LOW && modeButton == HIGH &&
        now - lastModeButtonEdgeMs >= BUTTON_DEBOUNCE_MS) {
        lastModeButtonEdgeMs = now;
        toggleOperatingMode();
    }

    if (previousTeachButton == LOW && teachButton == HIGH &&
        now - lastTeachButtonEdgeMs >= BUTTON_DEBOUNCE_MS) {
        lastTeachButtonEdgeMs = now;
        teachPressStartedMs = now;
    }

    if (previousTeachButton == HIGH && teachButton == LOW &&
        now - lastTeachButtonEdgeMs >= BUTTON_DEBOUNCE_MS) {
        lastTeachButtonEdgeMs = now;

        if (teachPressStartedMs != 0) {
            const uint32_t heldMs = now - teachPressStartedMs;
            if (heldMs >= TEACH_LONG_PRESS_MS) {
                clearProgram();
            } else {
                teachCurrentPoint();
            }
        }

        teachPressStartedMs = 0;
    }

    previousModeButton = modeButton;
    previousTeachButton = teachButton;
}

