Attiny2313/SCARA-Robot-Controler-BT/src/main.cpp
// ============================================================
// BLUEPAD32 I PAD / BLUEPAD32 AND GAMEPAD
// ============================================================
ControllerPtr getActiveController() {
    for (ControllerPtr controller : controllers) {
        if (controller != nullptr && controller->isConnected() && controller->isGamepad()) {
            return controller;
        }
    }
    return nullptr;
}

void updateControllerConnectedFlag() {
    robot.controllerConnected = getActiveController() != nullptr;
    digitalWrite(PIN_LED_BT, robot.controllerConnected ? HIGH : LOW);
}

void onConnectedController(ControllerPtr controller) {
    for (int i = 0; i < BP32_MAX_GAMEPADS; i++) {
        if (controllers[i] == nullptr) {
            controllers[i] = controller;
            lastGamepadPacketMs = millis();
            robot.gamepadArmed = false;
            gamepadNeutralSinceMs = 0;
            previousAutoDpad = 0;
            updateControllerConnectedFlag();
            Serial.printf("Pad podłączony, slot: %d\n", i);
            return;
        }
    }
}

// PL: Rozłączenie pada w AUTO zatrzymuje cykl przez PAUSE.
// EN: Gamepad disconnection during AUTO pauses the cycle.
void onDisconnectedController(ControllerPtr controller) {
    for (int i = 0; i < BP32_MAX_GAMEPADS; i++) {
        if (controllers[i] == controller) controllers[i] = nullptr;
    }

    previousAutoDpad = 0;

    if (robot.operatingMode == OperatingMode::AUTO) {
        pauseAuto("Pad rozłączony - AUTO PAUSE");
    } else {
        if (robot.gamepadArmed) emergencyStopMotion();
        robot.gamepadArmed = false;
        Serial.println("Pad rozłączony - MANUAL zatrzymany");
    }

    updateControllerConnectedFlag();
}

bool gamepadControlsNeutral(float leftX, float leftY, float rightX, float rightY,
                            ControllerPtr controller) {
    return leftX == 0.0f && leftY == 0.0f &&
           rightX == 0.0f && rightY == 0.0f &&
           !controller->a() && !controller->b() && !controller->miscStart();
}

// PL: Po połączeniu pad musi przez chwilę pozostawać neutralny.
//     Zapobiega to przypadkowemu ruchowi tuż po sparowaniu.
// EN: After connection the gamepad must remain neutral briefly.
//     This prevents unintended motion immediately after pairing.
bool updateGamepadArming(float leftX, float leftY, float rightX, float rightY,
                         ControllerPtr controller) {
    if (robot.operatingMode != OperatingMode::MANUAL) return false;
    if (robot.gamepadArmed) return true;

    const uint32_t now = millis();
    if (!gamepadControlsNeutral(leftX, leftY, rightX, rightY, controller)) {
        gamepadNeutralSinceMs = 0;
        return false;
    }

    if (gamepadNeutralSinceMs == 0) {
        gamepadNeutralSinceMs = now;
        return false;
    }

    if (now - gamepadNeutralSinceMs >= GAMEPAD_ARM_NEUTRAL_MS) {
        robot.gamepadArmed = true;
        previousPadStart = controller->miscStart();
        digitalWrite(PIN_LED_ERROR, LOW);
        Serial.println("Pad ARMED - MANUAL aktywny");
        return true;
    }

    return false;
}

// ============================================================
// SERWA NARZĘDZIA / TOOL SERVOS
// ============================================================
int angleToPulseUs(float angleDeg, float minimumDeg, float maximumDeg,
                   int minimumUs, int maximumUs) {
    const float angle = clampFloat(angleDeg, minimumDeg, maximumDeg);
    const float normalized = (angle - minimumDeg) / (maximumDeg - minimumDeg);
    return lroundf(minimumUs + normalized * (maximumUs - minimumUs));
}

void updateServoTargets(float rotateCommand, float gripCommand, float deltaTimeSeconds) {
    robot.toolRotateDeg += rotateCommand * TOOL_ROTATE_SPEED_DEG_S * deltaTimeSeconds;
    robot.gripperDeg += gripCommand * GRIP_SPEED_DEG_S * deltaTimeSeconds;

    robot.toolRotateDeg = clampFloat(robot.toolRotateDeg,
                                     TOOL_ROTATE_MIN_DEG, TOOL_ROTATE_MAX_DEG);
    robot.gripperDeg = clampFloat(robot.gripperDeg,
                                  GRIP_MIN_DEG, GRIP_MAX_DEG);
}

// PL: Prosty filtr pierwszego rzędu wygładza skokowe zmiany zadania serw.
// EN: A simple first-order filter smooths abrupt servo target changes.
void refreshServos() {
    if (robot.estopLatched) return;

    const uint32_t now = millis();
    if (now - lastServoUpdateMs < SERVO_PERIOD_MS) return;
    lastServoUpdateMs = now;

    servoRotateFilteredDeg +=
        (robot.toolRotateDeg - servoRotateFilteredDeg) * SERVO_FILTER_ALPHA;
    servoGripFilteredDeg +=
        (robot.gripperDeg - servoGripFilteredDeg) * SERVO_FILTER_ALPHA;

    servoRotate.writeMicroseconds(angleToPulseUs(
        servoRotateFilteredDeg,
        TOOL_ROTATE_MIN_DEG, TOOL_ROTATE_MAX_DEG,
        SERVO_ROTATE_MIN_US, SERVO_ROTATE_MAX_US));

    servoGrip.writeMicroseconds(angleToPulseUs(
        servoGripFilteredDeg,
        GRIP_MIN_DEG, GRIP_MAX_DEG,
        SERVO_GRIP_MIN_US, SERVO_GRIP_MAX_US));
}

// ============================================================
// MANUAL JOINT I TOOL / MANUAL JOINT AND TOOL CONTROL
// ============================================================
// PL: JOINT steruje osiami bezpośrednio: ARM1, ARM2 i Z.
// EN: JOINT directly controls the ARM1, ARM2 and Z axes.
void processJointMode(float axisX, float axisY, float axisZ, float deltaTimeSeconds) {
    JointPosition target = robot.joints;
    target.arm1Deg += axisX * ARM1_JOG_SPEED_DEG_S * deltaTimeSeconds;
    target.arm2Deg += -axisY * ARM2_JOG_SPEED_DEG_S * deltaTimeSeconds;
    target.zMm += -axisZ * Z_JOG_SPEED_MM_S * deltaTimeSeconds;
    commandManualJointPosition(target, deltaTimeSeconds);
}

// PL: TOOL steruje TCP w X/Y; kąty ramion są obliczane przez IK.
// EN: TOOL controls TCP in X/Y; joint angles are calculated by IK.
void processToolMode(float axisX, float axisY, float axisZ, float deltaTimeSeconds) {
    CartesianPosition desired = robot.tcp;
    desired.xMm += axisX * TOOL_XY_SPEED_MM_S * deltaTimeSeconds;
    desired.yMm += -axisY * TOOL_XY_SPEED_MM_S * deltaTimeSeconds;
    desired.zMm += -axisZ * Z_JOG_SPEED_MM_S * deltaTimeSeconds;
    desired.zMm = clampFloat(desired.zMm, Z_MIN_MM, Z_MAX_MM);

    JointPosition calculatedJoints;
    constexpr bool ELBOW_UP = true;

    if (!inverseKinematics(desired.xMm, desired.yMm, ELBOW_UP, calculatedJoints)) {
        digitalWrite(PIN_LED_ERROR, HIGH);
        return;
    }

    calculatedJoints.zMm = desired.zMm;
    digitalWrite(PIN_LED_ERROR, LOW);
    commandManualJointPosition(calculatedJoints, deltaTimeSeconds);
}

// PL: W AUTO pad służy do START/PAUSE/RESUME oraz regulacji prędkości ramion.
//     Timeout hasData() jest używany tylko w MANUAL; brak nowych ramek nie
//     oznacza rozłączenia kontrolera podczas programu automatycznego.
// EN: In AUTO the gamepad is used for START/PAUSE/RESUME and arm speed override.
//     hasData() timeout is used only in MANUAL; missing new packets does not
//     mean the controller disconnected during an automatic program.
void processGamepad(float deltaTimeSeconds) {
    ControllerPtr controller = getActiveController();

