Attiny2313/SCARA-Robot-Controler-BT/src/main.cpp
    updateActualRobotPosition();

    preferences.begin("scara-auto", false);
    loadProgram();

    BP32.setup(&onConnectedController, &onDisconnectedController);

    Serial.println();
    Serial.println("SCARA Controller - DEV AUTO/TEACH");
    Serial.println("UWAGA: HOME jest ręczny. Ustaw robot w HOME przed zasileniem/resetem.");
    Serial.println("MANUAL: START = JOINT/TOOL");
    Serial.println("TEACH: krótko = zapisz punkt, przytrzymaj 1.8 s = wyczyść program");
    Serial.println("MODE: MANUAL/AUTO");
    Serial.println("AUTO: START = start/pause/resume; program pracuje w pętli");
    Serial.println("AUTO SPEED: D-pad góra/dół = +/-10%, lewo = 100% (ramiona 50-250%; Z bez zmian)");
    Serial.printf("Wczytano %u punktów programu\n", programPointCount);
    printCurrentPosition();

    lastControlMs = millis();
}

// ============================================================
// PĘTLA GŁÓWNA / MAIN LOOP
// ============================================================
void loop() {
    // PL: Bluepad32 musi być obsługiwany możliwie często.
    // EN: Bluepad32 should be serviced as frequently as possible.
    BP32.update();

    updateEmergencyStop();
    updatePanelButtons();
    updateActualRobotPosition();
    refreshServos();

    const uint32_t now = millis();
    if (now - lastControlMs >= CONTROL_PERIOD_MS) {
        float deltaTimeSeconds = static_cast<float>(now - lastControlMs) / 1000.0f;
        lastControlMs = now;

        // PL: Ograniczenie dt chroni przed dużym skokiem zadania po chwilowym opóźnieniu.
        // EN: Limiting dt prevents a large command jump after a temporary delay.
        deltaTimeSeconds = clampFloat(deltaTimeSeconds, 0.0f, MAX_CONTROL_DT_S);

        if (!robot.estopLatched) {
            processGamepad(deltaTimeSeconds);
            processAuto();
        }
    }

    delay(1);
}
